benchmarksuite/surfaceTension/advectedCircleTet/advectedCircleTet/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "simulationParameters"

solvers
{
    alpha.water
    {

        interfaceCapturingScheme    $ADVECTSCHEME;
        interfaceRepresentation     $RECONSCHEME;


        vof2IsoTol          1e-8;
        surfCellTol         1e-8;
        writeVTK false;


        isoFaceTol          1e-8;
        surfCellTol         1e-8;
        nAlphaBounds        10;


        nAlphaSubCycles     1;
        nAlphaCorr          1;
        cAlpha              1;
        writeIsoFaces       false;

    }

    "pcorr.*"
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-10;
        relTol          0;
    }

    p_rgh
    {
        solver          GAMG;
        smoother        DICGaussSeidel;
 //       solver          PCG;
 //       preconditioner  DIC;
        tolerance       1e-10;
        relTol          0.00001;
        maxIter 20;
    }

    p_rghFinal
    {
        $p_rgh;
        tolerance       1e-12;
        relTol          0;
        maxIter 40;
    }

    U
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-10;
        relTol          0;
        minIter 5;
    }

    UFinal
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-10;
        relTol          0;
        minIter 5;
    }
}

PIMPLE
{
    momentumPredictor yes;
    nCorrectors     4;
    nNonOrthogonalCorrectors 0;
    correctPhi      no;

    pRefPoint       (0.0000 -0.003 0);
    pRefValue       1e5;
}


// ************************************************************************* //
